### 1. Import module and data

In [65]:
import pandas as pd
import seaborn as sb

from matplotlib import pyplot as plt

In [66]:
train = pd.read_csv("./dataset/train.csv")
test = pd.read_csv("./dataset/test.csv")

### 2. Data Overview

* Data Dictionary
    1. Survival : survival or not (0 : No, 1 : Yes)  
    2. pclass : Ticket class  
    3. sex : sex  
    4. Age : age in years  
    5. sibsp : # of sibilings / spouses aborad the titanic  
    6. parch : # of parents / children aborad the titanic  
    7. ticket : Ticket number  
    8. fare : Passenger fare  
    9. cabin : Cabin number  
    10. embarked : Port of Embarkation (C : Cherborug, Q : Queenstown, S : Southampton)

**Train Data**

각각 891개의 데이터가 있으며 12개의 column으로 이루어져 있음.

In [67]:
print(train.shape)

(891, 12)

Age에서 177개, Cabin에서 687개, Embarked에서 2개의 결측치가 있음.

In [68]:
print(train.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB
None

In [69]:
train.isnull().sum()

PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

각각의 데이터는 아래와 같이 이루어져 있음.

In [70]:
train.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

각 데이터의 분포는 아래와 같음.

In [71]:
train.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

**Test Data**

Test Data는 총 418개의 데이터로 이루어져있고 11개의 column으로 이루져있음

In [72]:
print(test.shape)

(418, 11)

Test 데이터는 Age에서 86개, Cabin에서 327개의 결측치가 있음.

In [73]:
print(test.info())

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 418 entries, 0 to 417
Data columns (total 11 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  418 non-null    int64
 1   Pclass       418 non-null    int64
 2   Name         418 non-null    object
 3   Sex          418 non-null    object
 4   Age          332 non-null    float64
 5   SibSp        418 non-null    int64
 6   Parch        418 non-null    int64
 7   Ticket       418 non-null    object
 8   Fare         417 non-null    float64
 9   Cabin        91 non-null     object
 10  Embarked     418 non-null    object
dtypes: float64(2), int64(4), object(5)
memory usage: 36.0+ KB
None

In [74]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

Test 데이터의 분포는 아래와 같음.

In [75]:
test.describe()

       PassengerId      Pclass         Age       SibSp       Parch        Fare
count   418.000000  418.000000  332.000000  418.000000  418.000000  417.000000
mean   1100.500000    2.265550   30.272590    0.447368    0.392344   35.627188
std     120.810458    0.841838   14.181209    0.896760    0.981429   55.907576
min     892.000000    1.000000    0.170000    0.000000    0.000000    0.000000
25%     996.250000    1.000000   21.000000    0.000000    0.000000    7.895800
50%    1100.500000    3.000000   27.000000    0.000000    0.000000   14.454200
75%    1204.750000    3.000000   39.000000    1.000000    0.000000   31.500000
max    1309.000000    3.000000   76.000000    8.000000    9.000000  512.329200

### 3. Data Analyzation for train

Age와 Embarked column의 결측치를 채워넣음. Embarked의 경우, 절대적 다수인 "S"로 채워주고, Age의 경우 column의 중간값을 채워넣어줌.  
Cabin의 경우 결측치가 너무 많으므로 추후 drop함.

In [76]:
train["Age"].fillna(train["Age"].median(), inplace=True)
train["Embarked"].fillna(train["Embarked"].mode()[0], inplace=True)

In [77]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     891 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

Name column의 경우 Prefix를 정규표현식을 이용해 추출함.

In [78]:
train["Prefix"] = train["Name"].str.extract("([A-Za-z]+)\.")
train["Prefix"].value_counts()

Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Major         2
Mlle          2
Col           2
Don           1
Mme           1
Ms            1
Jonkheer      1
Lady          1
Sir           1
Capt          1
Countess      1
Name: Prefix, dtype: int64

현재 str 되어있는 column을 모델이 인식할 수 있도록 int화 시킴.

In [79]:
train["Sex"].value_counts()

male      577
female    314
Name: Sex, dtype: int64

In [80]:
train["Embarked"].value_counts()

S    646
C    168
Q     77
Name: Embarked, dtype: int64

In [81]:
train["Prefix"].value_counts()

Mr          517
Miss        182
Mrs         125
Master       40
Dr            7
Rev           6
Major         2
Mlle          2
Col           2
Don           1
Mme           1
Ms            1
Jonkheer      1
Lady          1
Sir           1
Capt          1
Countess      1
Name: Prefix, dtype: int64

In [82]:
pre_dict = {"Mr":0, "Miss":1, "Mrs":2, "Master":3, "Dr":4, "Rev":4, "Major":4, "Col":4, "Mlle":4, "Ms":4, "Countess":4, "Jonkheer":4, "Lady":4, "Capt":4, "Don":4, "Sir":4, "Mme":4}
train["Prefix"] = train["Prefix"].map(pre_dict)

In [83]:
s_dict = {"male":0, "female":1}
train["Sex"] = train["Sex"].map(s_dict)

In [84]:
ebk_dict = {"S": 0, "C": 1, "Q": 2}
train["Embarked"] = train["Embarked"].map(ebk_dict)

In [85]:
train.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 13 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    int64
 5   Age          891 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     891 non-null    int64
 12  Prefix       891 non-null    int64
dtypes: float64(2), int64(8), object(3)
memory usage: 90.6+ KB

In [86]:
train.drop(["PassengerId", "Name", "Cabin", "Ticket"], axis=1, inplace=True)

In [87]:
train.head()

   Survived  Pclass  Sex   Age  SibSp  Parch     Fare  Embarked  Prefix
0         0       3    0  22.0      1      0   7.2500         0       0
1         1       1    1  38.0      1      0  71.2833         1       2
2         1       3    1  26.0      0      0   7.9250         0       1
3         1       1    1  35.0      1      0  53.1000         0       2
4         0       3    0  35.0      0      0   8.0500         0       0

Age와 Fare는 범위가 넓기때문에 4개의 범위로 grouping을 진행합니다.

In [88]:
train.loc[train["Age"] <=22.0, "Age"] = 0
train.loc[(train["Age"] >22.0) & (train["Age"] <= 28.0), "Age"] = 1
train.loc[(train["Age"] >28.0) & (train["Age"] <= 35.0), "Age"] = 2
train.loc[train["Age"] > 35.0, "Age"] = 3

train.loc[train["Fare"] <= 7.91, "Fare"] = 0
train.loc[(train["Fare"] > 7.91) & (train["Fare"] <= 14.4542), "Fare"] = 1
train.loc[(train["Fare"] > 14.4542) & (train["Fare"] <= 31), "Fare"] = 2
train.loc[train["Fare"] > 31, "Fare"] = 3
train["Age"] = train["Age"].astype("int64")
train["Fare"] = train["Fare"].astype("int64")

In [89]:
train.head()

   Survived  Pclass  Sex  Age  SibSp  Parch  Fare  Embarked  Prefix
0         0       3    0    0      1      0     0         0       0
1         1       1    1    3      1      0     3         1       2
2         1       3    1    1      0      0     1         0       1
3         1       1    1    2      1      0     3         0       2
4         0       3    0    2      0      0     1         0       0

### 4. Test Data transformation as Train

train과 동일하게 test data 또한 변형시켜줍니다.

In [90]:
test.isnull().sum()

PassengerId      0
Pclass           0
Name             0
Sex              0
Age             86
SibSp            0
Parch            0
Ticket           0
Fare             1
Cabin          327
Embarked         0
dtype: int64

In [91]:
def data_transformation(data):
    data["Age"].fillna(27, inplace=True)
    data["Embarked"].fillna("S", inplace=True)
    data["Fare"].fillna(14.454, inplace=True)
    data["Prefix"] = data["Name"].str.extract("([A-Za-z]+)\.")
    
    pre_dict = {"Mr":0, "Miss":1, "Mrs":2, "Master":3, "Dr":4, "Rev":4, "Col":4, "Ms":4, "Dona":4}
    s_dict = {"male":0, "female":1}
    ebk_dict = {"S": 0, "C": 1, "Q": 2}

    data["Prefix"] = data["Prefix"].map(pre_dict)
    data["Sex"] = data["Sex"].map(s_dict)
    data["Embarked"] = data["Embarked"].map(ebk_dict)

    data.loc[data["Age"] <= 22.0, "Age"] = 0
    data.loc[(data["Age"] > 22) & (data["Age"] <= 28.0), "Age"] = 1
    data.loc[(data["Age"] > 28) & (data["Age"] <= 35.0), "Age"] = 2
    data.loc[data["Age"] > 35, "Age"] = 3

    data.loc[data["Fare"] <= 7.91, "Fare"] = 0
    data.loc[(data["Fare"] > 7.91) & (data["Fare"] <= 14.4542)] = 1
    data.loc[(data["Fare"] > 14.4542) & (data["Fare"] <= 31)] = 2
    data.loc[data["Fare"] > 31] = 3

    data["Age"] = data["Age"].astype("int64")
    data["Fare"] = data["Fare"].astype("int64")

    data.drop(["PassengerId", "Name", "Cabin", "Ticket"], axis=1, inplace=True)

    return data

In [92]:
test = data_transformation(test)